#include <stdlib.h>//前置處理器的一種,將stdlib.h檔案包含進來 
#include <stdio.h>//前置處理器的一種，將stdio.h檔案包含進來
#include <conio.h>//前置處理器的一種，將conio.h檔案包含進來

void option(void);//副程式 
void option_A(void);

int main (void)//主函數main()從這開始 
{
	int pw; //設變數整數pw 
	char ch; //設變數字元x,z 
	option_A();//呼叫副程式 
	printf("請輸入密碼\n");//顯示:請輸入密碼
	scanf("%d",&pw);//輸入1個byte大小的整數 
	if(pw==2024) //當pw==2024時 
	{
		printf("welcome!\n"); //顯示welcome!並換行 
	}
	else
	{ 
		printf("輸入錯誤 結束執行");//顯示輸入錯誤結束執行 
		return 0;//回傳一個0給os
	}
	system("CLS");//清除螢幕
	printf("請輸入要執行的項目\n"); //顯示請輸入要執行的項目 
	puts("-------------------------");
	puts("|  'A'...'Z':Uppercase  |");
	puts("|  'a'...'z':Lowercase  |");
	puts("|  '0'...'9':Digit      |");
	puts("|  Otherwise:Name       |");
	puts("-------------------------");
	 
	
	fflush(stdin);//清除緩衝區 
	scanf("%c",&ch);//輸入1個byte大小的字元 
	
	system("CLS");//清除螢幕
	if (ch >= 'A' && ch <= 'Z')//若輸入字元在A到Z之間 
	{
	
		
            printf("Uppercase\n");//顯示Uppercase 
     }
		else if (ch >= 'a' && ch <= 'z') //若輸入字元在a到z之間 
		
            printf("Lowercase\n");//顯示Lowercase
         
		else if (ch >= '0' && ch <= '9') //若輸入字元在0到9之間
		
            printf("Digit\n");//顯示Digit
         
		else 
		
            printf("E3A26毛愷\n");//顯示E3A26毛愷 
	
	
	system("PAUSE");//螢幕暫停，等待使用著按任一鍵 
	return 0;//回傳一個0給os
	
}
	
	void option_A(void)//副程式 
	{
		char ch;//設變數ch為字元
		puts("* ++++++++++++++++++++++++++++++++++++++++++++++++++");
		puts(" *");
		puts("* ++++++++++*########*++++++++++*########*++++++++++");
		puts(" *");
		puts("* ++++++++++@@@@@@@@@@++++++++++@@@@@@@@@@++++++++++");
		puts(" *");
		puts("* ++++++++++@@@@@@@@@@++++++++++@@@@@@@@@@++++++++++");
		puts(" *");
		puts("* ++++++++++@@@@@@@@@@++++++++++@@@@@@@@@@++++++++++");
		puts(" *");
		puts("* ++++++++++**********+++++++++***********++++++++++");
		puts(" *");
		puts("* ++++++++++=========+@@@@@@@@@@+=========++++++++++");
		puts(" *");
		puts("* ++++++++++++++++++++@@@@@@@@@@++++++++++++++++++++");
		puts(" *");
		puts("* ++++++++++++++++++++@@@@@@@@@@++++++++++++++++++++");
		puts(" *");
		puts("* +++++++++++++++%%%%%@@@@@@@@@@%%%%%+++++++++++++++");
		puts(" *");
		puts("* +++++++++++++++@@@@@@@@@@@@@@@@@@@@+++++++++++++++");
		puts(" *");
		puts("* +++++++++++++++@@@@@%%%%%%%%%%@@@@@+++++++++++++++");
		puts(" *");
		puts("* +++++++++++++++@@@@@==========@@@@@+++++++++++++++");
		puts(" *");
		puts("* +++++++++++++++@@@@@++++++++++@@@@@+++++++++++++++");
		puts(" *");
		puts("* +++++++++++++++=====++++++++++=====+++++++++++++++");
		ch=getch();//輸入任一值 
		system("CLS");//清除螢幕 
		system("pause");//螢幕暫停，等待使用著按任一鍵
		return;
	}
	
	
	/*心得:
		這一次是我重修，雖然教的內容都差不多，但程式對我來說一直是一個罩門，況且這次作業又要用不一樣的形式繳交，這是讓我覺得最難的部分
	，因為以前都沒用過的關係，再加上不知道為甚麼我的電腦出甚麼問題，照著影片上面的指示操作，卻一直會有問題，所以只能一直去找學長幫忙，
	雖然這個真的讓我覺得很麻煩，但是因為是以後業界會用到的，所以我也會盡力學，但在這次設定的過程真的覺得麻煩學長一直幫我，我也會盡力
	去學習我之前沒學會的程式*/ 
